blog/rails如何做xss防护.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef0e6fb">1. 什么是HTML Escaping</a></li>
<li><a href="#orgfabe4f2">2. html<sub>safe</sub></a></li>
<li><a href="#org3655122">3. 从Rails传递给HTML</a>
<ul>
<li><a href="#org337370e">3.1. HTML elements</a></li>
<li><a href="#orgb25a629">3.2. Attributes or Tag Names</a></li>
<li><a href="#org1f2cb05">3.3. Attribute Values</a></li>
</ul>
</li>
<li><a href="#org811a282">4. 从Rails传递给JavaScript</a>
<ul>
<li><a href="#org19950a9">4.1. 原则</a>
<ul>
<li><a href="#orgef69740">4.1.1. 传递numbers to JavaScript</a></li>
<li><a href="#orgcdaa8dc">4.1.2. 传递text to JavaScript</a></li>
</ul>
</li>
<li><a href="#orgc53f502">4.2. </a></li>
</ul>
</li>
<li><a href="#orgf4560fe">5. 传递Json to HTML/JavaScript</a>
<ul>
<li><a href="#org9843811">5.1. Json Escaping</a></li>
<li><a href="#org028cf1c">5.2. Json to HTML</a>
<ul>
<li><a href="#orgc558125">5.2.1. to HTML elements</a></li>
<li><a href="#orgcb5fda2">5.2.2. to HTML attributes</a></li>
<li><a href="#org7cbaab8">5.2.3. 为什么要用to<sub>json</sub></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org121f409">6. 一些不安全的helpers</a>
<ul>
<li><a href="#orgc245f42">6.1. link<sub>to</sub></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
xss攻击是一种十分常见的web攻击形式，它是通过在客户端注入script代码，当用户浏览页面时触发的。xss攻击一般用来获取用户的session, cookie，从而绕过登陆验证等。xss的本质并不在于html，而是在于控制浏览器生成的非法dom，所以并不在于server端，也不要通过过滤html标签的方式去预防xss。
</p>

<p>
Rails自带xss防护，它会将所有的html escape掉，html需要手动标记才能正常显示。这个特性简直是爽到爆，然而只是对于全栈使用Rails的情况才能发挥功能，对于前后端分离的情况，需要探索其他方案。
</p>

<div id="outline-container-orgef0e6fb" class="outline-2">
<h2 id="orgef0e6fb"><span class="section-number-2">1</span> 什么是HTML Escaping</h2>
<div class="outline-text-2" id="text-1">
<p>
对于脚本编程语言，经常会从代码中转移出一些特殊的数据。比如我们可能通过&lt;&gt;判断HTML，然而问题是，有的正常数据当中可能也包含这些tags。
</p>

<p>
Rails使用ERB:Util#html<sub>escape方法来回避真正的HTML标签</sub>，这个方法可以对HTML标签进行转换。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">{</span> <span style="color: #a3be8c;">'&amp;'</span> =&gt; <span style="color: #a3be8c;">'&amp;amp;'</span>, <span style="color: #a3be8c;">'&gt;'</span> =&gt; <span style="color: #a3be8c;">'&amp;gt;'</span>, <span style="color: #a3be8c;">'&lt;'</span> =&gt; <span style="color: #a3be8c;">'&amp;lt;'</span>, <span style="color: #a3be8c;">'"'</span> =&gt; <span style="color: #a3be8c;">'&amp;quot;'</span>, <span style="color: #a3be8c;">"'"</span> =&gt; <span style="color: #a3be8c;">'&amp;#39;'</span> <span style="color: #8c8c8c;">}</span>
</pre>
</div>

<p>
Rails默认对HTML进行escape，从而防止带有xss攻击行为的非法dom生成，比如
</p>

<div class="org-src-container">
<pre class="src src-ruby">params<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">:name</span><span style="color: #8c8c8c;">]</span> = <span style="color: #a3be8c;">'&lt;script&gt;alert(1)&lt;/script&gt;'</span>
&lt;b&gt;<span style="color: #c0c5ce;">Hello</span> &lt;<span style="color: #a3be8c;">%= params[:name] %&gt;&lt;/b&gt;</span>
</pre>
</div>

<p>
Rails默认输出为
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;b&gt; <span style="color: #c0c5ce;">Hello</span> &amp;lt;script&amp;gt;alert<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">)</span>&amp;lt;<span style="color: #a3be8c;">/script&amp;gt;gt; &lt;/</span>b&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfabe4f2" class="outline-2">
<h2 id="orgfabe4f2"><span class="section-number-2">2</span> html<sub>safe</sub></h2>
<div class="outline-text-2" id="text-2">
<p>
如果想要正常输出html，就需要认为标记html<sub>safe</sub>
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;b&gt;<span style="color: #c0c5ce;">Hello</span> &lt;<span style="color: #a3be8c;">%=params[:name].html_safe%&gt;&lt;/b&gt;</span>
</pre>
</div>

<p>
当string标记为html<sub>safe时</sub>，会创建一个ActiveSupport::SafeBuffer类的对象，所有的字符串在进入SafeBuffer前都会被Rails编码以保证安全
</p>
</div>
</div>

<div id="outline-container-org3655122" class="outline-2">
<h2 id="org3655122"><span class="section-number-2">3</span> 从Rails传递给HTML</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org337370e" class="outline-3">
<h3 id="org337370e"><span class="section-number-3">3.1</span> HTML elements</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Rails会自动编码，所以必须要标记html<sub>safe</sub>，刚才已经说了
</p>
</div>
</div>

<div id="outline-container-orgb25a629" class="outline-3">
<h3 id="orgb25a629"><span class="section-number-3">3.2</span> Attributes or Tag Names</h3>
<div class="outline-text-3" id="text-3-2">
<p>
无论编码与否，attributes和tag names不允许被外部数据创建，因为这是数据html本身的一部分，如果不这样做就相当于给了外部写html的权限
</p>
</div>
</div>

<div id="outline-container-org1f2cb05" class="outline-3">
<h3 id="org1f2cb05"><span class="section-number-3">3.3</span> Attribute Values</h3>
<div class="outline-text-3" id="text-3-3">
<p>
比如src href style等，这些attributes的值不允许直接从数据中传入，rails编码后可以直接传入
</p>
<div class="org-src-container">
<pre class="src src-ruby">&lt;b name=<span style="color: #a3be8c;">"&lt;%= params[:name] %&gt;""&gt;&lt;/b&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org811a282" class="outline-2">
<h2 id="org811a282"><span class="section-number-2">4</span> 从Rails传递给JavaScript</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org19950a9" class="outline-3">
<h3 id="org19950a9"><span class="section-number-3">4.1</span> 原则</h3>
<div class="outline-text-3" id="text-4-1">
<blockquote>
<ol class="org-ol">
<li>传递给javascript的内容有可能是string, email, integer等等</li>
<li>javascript可以被当成是html的一个sub text，所以我们需要同时考虑javascript和html的注入问题</li>
<li>不能有数据执行eval或其他这种类型的function，因为这种函数是直接执行传来的string，挡不住的，相关的方法有：
eval, setInterval, setTimeOut, execScript, write, writeLn, body.innerHtml</li>
</ol>
</blockquote>
</div>

<div id="outline-container-orgef69740" class="outline-4">
<h4 id="orgef69740"><span class="section-number-4">4.1.1</span> 传递numbers to JavaScript</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
javascript不像html，有明显的html标签可以encode，下面的例子是个标准的注入
</p>

<blockquote>
<p>
javascript注入貌似只存在于全栈框架，前后端分离要怎么注入javascript呢?
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = &lt;<span style="color: #a3be8c;">%= params[:id] %&gt;&lt;/script&gt;</span>
</pre>
</div>

<p>
如果参数为?id=alert(document.cookie)，那么输出就会是
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = alert<span style="color: #8c8c8c;">(</span>document.cookie<span style="color: #8c8c8c;">)</span>&lt;<span style="color: #a3be8c;">/script&gt;</span>
</pre>
</div>

<p>
只有一种方法可以防止这种漏洞，就是确保传入的参数是个integer
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = &lt;<span style="color: #a3be8c;">%= params[:id].to_i %&gt;&lt;/script&gt;</span>
</pre>
</div>

<p>
如果他是个字符串那么就会变成0
</p>
</div>
</div>

<div id="outline-container-orgcdaa8dc" class="outline-4">
<h4 id="orgcdaa8dc"><span class="section-number-4">4.1.2</span> 传递text to JavaScript</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
javascript是一种很有意思的语言，包含了大量的特殊的字符，显然这些字符全都escape掉不切实际。Rails采用的办法是。escape掉html字符，然后用单引号包裹起来。
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = <span style="color: #a3be8c;">'&lt;%=param[:id] %&gt;'</span> &lt;<span style="color: #a3be8c;">/script&gt;</span>
</pre>
</div>

<p>
如果传入?id='\+alert(1)\+'，就会变成
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = <span style="color: #a3be8c;">'&amp;#39;+alert(1)+&amp;#39;'</span>&lt;<span style="color: #a3be8c;">/script&gt;</span>
</pre>
</div>

<p>
如果传入'?id="&gt;&lt;script&gt;alert(1)&lt;/script&gt;'
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;current_user_id = <span style="color: #a3be8c;">'&amp;quot;/&amp;gt;&amp;lt;script&amp;gt;alert(1)&amp;lt;/script&amp;gt;'</span>&lt;<span style="color: #a3be8c;">/script&gt;</span>
</pre>
</div>

<blockquote>
<p>
也就是说，单引号将代码变成字符串无法执行，html<sub>escape防止参数逃脱单引号</sub>
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgc53f502" class="outline-3">
<h3 id="orgc53f502"><span class="section-number-3">4.2</span> </h3>
</div>
</div>

<div id="outline-container-orgf4560fe" class="outline-2">
<h2 id="orgf4560fe"><span class="section-number-2">5</span> 传递Json to HTML/JavaScript</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9843811" class="outline-3">
<h3 id="org9843811"><span class="section-number-3">5.1</span> Json Escaping</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Rails通过ERB::Util#json<sub>escape编码json的特殊字符</sub>
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">{</span> <span style="color: #a3be8c;">'&amp;'</span> =&gt; <span style="color: #a3be8c;">'\u0026'</span>, <span style="color: #a3be8c;">'&gt;'</span> =&gt; <span style="color: #a3be8c;">'\u003e'</span>, <span style="color: #a3be8c;">'&lt;'</span> =&gt; <span style="color: #a3be8c;">'\u003c'</span>, <span style="color: #a3be8c;">"\u2028"</span> =&gt; <span style="color: #a3be8c;">'\u2028'</span>, <span style="color: #a3be8c;">"\u2029"</span> =&gt; <span style="color: #a3be8c;">'\u2029'</span> <span style="color: #8c8c8c;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby">&lt;<span style="color: #a3be8c;">%= json_escape (User.last.to_json) %&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">{</span><span style="color: #a3be8c;">"id"</span>:<span style="color: #d08770;">1</span>,<span style="color: #a3be8c;">"name"</span>:<span style="color: #a3be8c;">"\u003cgreat\u003e"</span>,<span style="color: #a3be8c;">"created_at"</span>:<span style="color: #a3be8c;">"2016-02-24T13:14:05.049Z"</span>,<span style="color: #a3be8c;">"updated_at"</span>:<span style="color: #a3be8c;">"2016-02-24T13:14:05.049Z"</span><span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org028cf1c" class="outline-3">
<h3 id="org028cf1c"><span class="section-number-3">5.2</span> Json to HTML</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgc558125" class="outline-4">
<h4 id="orgc558125"><span class="section-number-4">5.2.1</span> to HTML elements</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-ruby">&lt;b&gt;<span style="color: #c0c5ce;">Here</span> is some json <span style="color: #d08770;">data:</span>
&lt;<span style="color: #a3be8c;">%={:name =</span>&gt; <span style="color: #a3be8c;">"jack"</span>, <span style="color: #d08770;">:id</span> =&gt; params<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">:id</span><span style="color: #8c8c8c;">]</span><span style="color: #88090B;">}</span>.to_json%&gt;
&lt;<span style="color: #a3be8c;">/b&gt;</span>
</pre>
</div>

<p>
只要是通过Rails的合理的方式创建的Json，比如Hash#to<sub>json</sub>，上面说的字符都会自动编码，从而防止xss，'?id=&lt;script&gt;alert(1)&lt;/script&gt;'就会变成
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;b&gt;<span style="color: #c0c5ce;">Here</span> is some json <span style="color: #d08770;">data:</span> <span style="color: #8c8c8c;">{</span>&amp;quot;name&amp;quot;<span style="color: #d08770;">:&amp;quot</span>;jack&amp;quot;,&amp;quot;id&amp;quot;<span style="color: #d08770;">:&amp;quot</span>;\u003cscript\u003ealert<span style="color: #93a8c6;">(</span><span style="color: #d08770;">1</span><span style="color: #93a8c6;">)</span>\u003c/script\u003e&amp;quot;<span style="color: #8c8c8c;">}</span>&lt;<span style="color: #a3be8c;">/b&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb5fda2" class="outline-4">
<h4 id="orgcb5fda2"><span class="section-number-4">5.2.2</span> to HTML attributes</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
json string同样也会被html<sub>escape编码</sub>
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;b user-info=<span style="color: #a3be8c;">"&lt;%={:name =&gt; "</span>jack<span style="color: #a3be8c;">", :id =&gt; params[:id]}.to_json%&gt;"</span>&lt;<span style="color: #a3be8c;">/b&gt;</span>
</pre>
</div>

<p>
参数是?id=" onmouseover=alert(1)时，输出为
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;b user-info=<span style="color: #a3be8c;">"{&amp;quot;name&amp;quot;:&amp;quot;jack&amp;quot;,&amp;quot;id&amp;quot;:&amp;quot;\&amp;quot; onmouseover=alert(1)&amp;quot;}"</span>&lt;<span style="color: #a3be8c;">/b&gt;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org7cbaab8" class="outline-4">
<h4 id="org7cbaab8"><span class="section-number-4">5.2.3</span> 为什么要用to<sub>json</sub></h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
如果不是用合理的方式构建json，那么json<sub>escape没有用</sub>
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #bf616a;">@json_crafted</span> = <span style="color: #a3be8c;">'{"name":"jack","id":&#8221;'</span>+ params<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">:id</span><span style="color: #8c8c8c;">]</span> +<span style="color: #a3be8c;">'&#8221;}'</span>

&lt;script&gt;user=&lt;<span style="color: #a3be8c;">%= json_escape(@json_crafted.html_safe) %&gt;&lt;/script&gt;</span>
</pre>
</div>
<p>
传入?id="<del>alert(1)</del>"，则不会编码
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;script&gt;user=<span style="color: #8c8c8c;">{</span><span style="color: #a3be8c;">"name"</span>:<span style="color: #a3be8c;">"jack"</span>,<span style="color: #a3be8c;">"id"</span>:<span style="color: #a3be8c;">""</span>+alert<span style="color: #93a8c6;">(</span><span style="color: #d08770;">1</span><span style="color: #93a8c6;">)</span>+<span style="color: #a3be8c;">""</span><span style="color: #8c8c8c;">}</span>&lt;<span style="color: #a3be8c;">/script&gt;</span>
</pre>
</div>
<p>
这种情况注入的javascript就会执行（因为双引号也被绕过了）
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org121f409" class="outline-2">
<h2 id="org121f409"><span class="section-number-2">6</span> 一些不安全的helpers</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc245f42" class="outline-3">
<h3 id="orgc245f42"><span class="section-number-3">6.1</span> link<sub>to</sub></h3>
<div class="outline-text-3" id="text-6-1">
<p>
link<sub>to</sub> 是一个生成&lt;a&gt; dom的rails方法
</p>

<div class="org-src-container">
<pre class="src src-ruby">link_to <span style="color: #a3be8c;">"Visit Other Site"</span>, <span style="color: #a3be8c;">"http://www.rubyonrails.org/"</span>

<span style="color: #c0c5ce;"># </span><span style="color: #65737e;">=&gt; &lt;a href="http://www.rubyonrails.org/" &gt;Visit Other Site&lt;/a&gt;</span>
</pre>
</div>

<p>
这个方法对于硬编码来说还是安全的，但对于参数输入就会有xss漏洞
</p>

<div class="org-src-container">
<pre class="src src-ruby">link_to <span style="color: #a3be8c;">"Great link"</span>, params<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">:link</span><span style="color: #8c8c8c;">]</span>

&lt;a href=<span style="color: #a3be8c;">"javascript:alert(document.domain)"</span>&gt;<span style="color: #c0c5ce;">Great</span> link&lt;<span style="color: #a3be8c;">/a&gt;</span>
</pre>
</div>

<p>
解决方法也很简单，只要保证参数一定是个http或者https打头的就行了
</p>
<blockquote>
<p>
不太行吧，为什么非要http打头，而且http="alert(1)"呢
</p>
</blockquote>
<p>
可以使用URI.parse方法，具体范例如下
</p>

<div class="org-src-container">
<pre class="src src-ruby">$ bundle <span style="color: #d08770;">exec</span> rails c

<span style="color: #c0c5ce;">Running</span> via <span style="color: #c0c5ce;">Spring</span> preloader <span style="color: #b48ead;">in</span> process <span style="color: #d08770;">39287</span>

<span style="color: #c0c5ce;">Loading</span> development environment <span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">Rails</span> <span style="color: #d08770;">4</span>.<span style="color: #d08770;">2</span>.<span style="color: #d08770;">5</span>.<span style="color: #d08770;">1</span><span style="color: #8c8c8c;">)</span>

<span style="color: #d08770;">2</span>.<span style="color: #d08770;">1</span>.<span style="color: #d08770;">1</span> :<span style="color: #d08770;">001</span> &gt; <span style="color: #c0c5ce;">URI</span>.parse<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">"javascript:alert(1)"</span><span style="color: #8c8c8c;">)</span>

=&gt; <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;URI::Generic:0x00000101bf1970 URL:javascript:alert(1)&gt;</span>

<span style="color: #d08770;">2</span>.<span style="color: #d08770;">1</span>.<span style="color: #d08770;">1</span> :<span style="color: #d08770;">002</span> &gt; <span style="color: #c0c5ce;">URI</span>.parse<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">"javascript:alert(1)"</span><span style="color: #8c8c8c;">)</span>.scheme

=&gt; <span style="color: #a3be8c;">"javascript"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
